docs: mermaid diagram + spanish readme
